In [1]:
import mysql.connector
from mysql.connector import Error
import pandas as pd

In [24]:
from multiprocessing import connection


def create_server_connection(host_name, user_name, user_password):
    connection = None
    try:
        connection = mysql.connector.connect(
            host=host_name,
            user=user_name,
            passwd=user_password,
        )
        print("MySQL Database connection successful")
    except Error as err:
        print(f"Error: '{err}'")

    return connection

def create_db_connection(host_name, user_name, user_password, db_name):
    connection = None
    try:
        connection = mysql.connector.connect(
            host=host_name,
            user=user_name,
            passwd=user_password,
            database=db_name
        )
        print("MySQL Database connection successful")
    except Error as err:
        print(f"Error: '{err}'")

    return connection

def execute_query(connection, query):
    cursor = connection.cursor(buffered = True)
    try:
        cursor.execute(query)
        connection.commit()
        print("Query successful")
    except Error as err:
        print(f"Error: '{err}'")

def read_query(connection, query):
    cursor = connection.cursor()
    result = None
    try:
        cursor.execute(query)
        result = cursor.fetchall()
        return result
    except Error as err:
        print(f"Error: '{err}'")

# SQL Queries

1. w3resource.com
salesman_id |    name    |   city   | commission 
-------------+------------+----------+------------
        5001 | James Hoog | New York |       0.15
        5002 | Nail Knite | Paris    |       0.13
        5005 | Pit Alex   | London   |       0.11
        5006 | Mc Lyon    | Paris    |       0.14
        5007 | Paul Adam  | Rome     |       0.13
        5003 | Lauson Hen | San Jose |       0.12

In [25]:
connection = create_server_connection('localhost', 'root', 'torax.22')

MySQL Database connection successful

In [26]:
queries = '''
CREATE TABLE salesman(
    salesman_id INT PRIMARY KEY,
    name VARCHAR(255) NOT NULL,
    city VARCHAR(255) NOT NULL,
    commission FLOAT NOT NULL
);

INSERT INTO salesman VALUES
(5001, 'James Hoog', 'New York', 0.15),
(5002, 'Nail Knite', 'Paris', 0.13),
(5005, 'Pit Alex', 'London', 0.11),
(5007, 'Paul Adam', 'Rome', 0.13),
(5003, 'Lauson Hen', 'San Jose', 0.12);

SELECT * FROM salesman;
SELECT 'This is SQL Exercise, Practice and Solution';
'''

In [ ]:
3002, 'Nick Rimando', 'New York',   100, 5001
        3007, 'Brad Davis    , 'New York  ,200 , 5001
        3005, 'Graham Zusi   , 'California,200 , 5002
        3008, 'Julian Green  , 'London    ,300 , 5002
        3004, 'Fabian Johnson, 'Paris     ,300 , 5006
        3009, 'Geoff Cameron , 'Berlin    ,100 , 5003
        3003, 'Jozy Altidor  , 'Moscow    ,200 , 5007
        3001, 'Brad Guzan    , 'London    ,NULL    , 5005